
# Efinity Interface Designer SDC
# Version: 2022.2.322.4.7
# Date: 2024-03-14 13:56

# Copyright (C) 2017 - 2022 Efinix Inc. All rights reserved.

# Device: T13F256
# Project: PiStorm16
# Timing Model: C3 (final)

# PLL Constraints
################# 8.333 (120 MHz), 7.143 (140 MHz), 6.667 (150 MHz), 6.024 (166 MHz), 6.994 (143 MHz)
create_clock -period 7.1429 [get_ports {SYS_PLL_CLKOUT0}]
create_clock -period 140 [get_ports {CLK_7M}]

set_clock_groups -asynchronous -group {SYS_PLL_CLKOUT0} -group {CLK_7M}

# False paths
####################

set_false_path -from [get_ports {PI_GPIO_IN* D_IN*}]
set_false_path -to [get_ports {PI_GPIO_OUT* A_OUT* D_OUT*}]
#set_false_path -to [get_cells r_address_p2*]

# GPIO Constraints
####################

set_multicycle_path 2 -setup -to [get_cells req_data_read*]
set_multicycle_path 2 -setup -to [get_cells A_OUT*]
set_multicycle_path 2 -setup -to [get_cells D_OUT*]
set_multicycle_path 2 -setup -to [get_cells D_OE*]
set_multicycle_path 2 -setup -from [get_cells D_IN*]

#set_output_delay -clock MCCLK -min 0 [get_ports {A_OUT*}]
#set_output_delay -clock MCCLK -max 3 [get_ports {A_OUT*}]

# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IN_CLK_50M}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IN_CLK_50M}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nDTACK}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nDTACK}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[18]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[18]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[19]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[19]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[20]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[20]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[21]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[21]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[22]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[22]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[23]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[23]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nAS_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nAS_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nAS_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nAS_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nAS_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nAS_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBG_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBG_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBG_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBG_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBG_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBG_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBGACK_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBGACK_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBGACK_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBGACK_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBGACK_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBGACK_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBR_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBR_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBR_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBR_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBR_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBR_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nLDS_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nLDS_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nLDS_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nLDS_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nLDS_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nLDS_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nUDS_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nUDS_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nUDS_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nUDS_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nUDS_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nUDS_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[18]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[18]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[19]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[19]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[20]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[20]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[21]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[21]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[22]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[22]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[23]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[23]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[24]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[24]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[24]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[24]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[24]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[24]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[25]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[25]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[25]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[25]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[25]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[25]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[26]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[26]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[26]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[26]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[26]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[26]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[27]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[27]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[27]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[27]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[27]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[27]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {RnW_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {RnW_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {RnW_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {RnW_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {RnW_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {RnW_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[8]}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IPL[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IPL[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DBG_CLK}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DBG_CLK}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DBG_DAT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DBG_DAT}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[4]}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {CLK_7M}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {CLK_7M}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IPL[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IPL[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IPL[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IPL[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBERR}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBERR}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVPA}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVPA}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nHALT_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nHALT_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nHALT_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nHALT_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nHALT_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nHALT_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nRESET_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nRESET_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nRESET_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nRESET_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nRESET_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nRESET_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVMA_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVMA_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVMA_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVMA_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVMA_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVMA_OE}]

# LVDS Tx Constraints
####################
