
# Efinity Interface Designer SDC
# Version: 2022.2.322.4.7
# Date: 2024-03-14 13:56

# Copyright (C) 2017 - 2022 Efinix Inc. All rights reserved.

# Device: T13F256
# Project: PiStorm16
# Timing Model: C3 (final)

# PLL Constraints
################# 8.333 (120 MHz), 7.1429 (140 MHz), 6.667 (150 MHz), 6.024 (166 MHz), 6.994 (143 MHz)
create_clock -period 8.333 SYS_PLL_CLKOUT0

# 68000 bus clock
####################
create_clock -period 140 CLK_7M

# Setup and hold times from report
set_clock_latency -source -setup 1.907 [get_ports CLK_7M]
set_clock_latency -source -hold 0.734 [get_ports CLK_7M]

# both clocks are asynchronous
set_clock_groups -asynchronous -group {SYS_PLL_CLKOUT0} -group {CLK_7M}

# 68000 bus constraints
####################
# LDS, UDS, AS: min 3 max 25 ns. /* max reduced to 5 ns... */
set_output_delay -clock CLK_7M -min 4.927 [get_ports {nLDS_OE}]
set_output_delay -clock CLK_7M -max 10.010 [get_ports {nLDS_OE}]
set_output_delay -clock CLK_7M -min 4.777 [get_ports {nUDS_OE}]
set_output_delay -clock CLK_7M -max 9.620 [get_ports {nUDS_OE}]
set_output_delay -clock CLK_7M -min 4.777 [get_ports {nAS_OE}]
set_output_delay -clock CLK_7M -max 9.620 [get_ports {nAS_OE}]

#set_output_delay -clock CLK_7M -clock_fall -min 4.927 [get_ports {nLDS_OE}] -add_delay
#set_output_delay -clock CLK_7M -clock_fall -max 10.010 [get_ports {nLDS_OE}] -add_delay
#set_output_delay -clock CLK_7M -clock_fall -min 4.777 [get_ports {nUDS_OE}] -add_delay
#set_output_delay -clock CLK_7M -clock_fall -max 9.620 [get_ports {nUDS_OE}] -add_delay
#set_output_delay -clock CLK_7M -clock_fall -min 4.777 [get_ports {nAS_OE}] -add_delay
#set_output_delay -clock CLK_7M -clock_fall -max 9.620 [get_ports {nAS_OE}] -add_delay

# RnW: min 0 max 25 ns. /* max reduced to 5 ns... */
set_output_delay -clock CLK_7M -min 1.777 [get_ports {RnW_OE}]
set_output_delay -clock CLK_7M -max 9.620 [get_ports {RnW_OE}]
#set_output_delay -clock CLK_7M -clock_fall -min 1.777 [get_ports {RnW_OE}] -add_delay
#set_output_delay -clock CLK_7M -clock_fall -max 9.620 [get_ports {RnW_OE}] -add_delay

# FC[2:0]: min 0 max 25 ns. /* max reduced to 5 ns... */
#set_output_delay -clock CLK_7M -min 1.150 [get_ports {FC_OE[0]}]
#set_output_delay -clock CLK_7M -max 7.990 [get_ports {FC_OE[0]}]
#set_output_delay -clock CLK_7M -min 1.150 [get_ports {FC_OE[1]}]
#set_output_delay -clock CLK_7M -max 7.990 [get_ports {FC_OE[1]}]
#set_output_delay -clock CLK_7M -min 1.150 [get_ports {FC_OE[2]}]
#set_output_delay -clock CLK_7M -max 7.990 [get_ports {FC_OE[2]}]

# Shifting and widening windows - multicycle paths
# req_data_read[0] - TXN busy is cleared one cycle later so sampling window is 2 cycles
#set_multicycle_path -setup 2 -to [get_cells req_data_read[0]*]
#set_multicycle_path -hold 1 -to [get_cells req_data_read[0]*]

# req_data_read[1] - second cycle needs some setup from Pi before reading value,
# so more freedom is granted
#set_multicycle_path -setup 5 -to [get_cells req_data_read[1]*]
#set_multicycle_path -hold 4 -to [get_cells req_data_read[1]*]

# r_address_p2 is used almost 500ns after r_address. Give it a lot of time.
#set_multicycle_path -setup 25 -to [get_cells r_address_p2*]
#set_multicycle_path -hold 24 -to [get_cells r_address_p2*]

# A_OUT, D_OUT can settle for long time
#set_multicycle_path -setup 4 -to [get_cells A_OUT*]
#set_multicycle_path -hold 3 -to [get_cells A_OUT*]
#set_multicycle_path -setup 4 -to [get_cells A_OE*]
#set_multicycle_path -hold 3 -to [get_cells A_OE*]
#set_multicycle_path -setup 4 -to [get_cells D_OUT*]
#set_multicycle_path -hold 3 -to [get_cells D_OUT*]
#set_multicycle_path -setup 4 -to [get_cells D_OE*]
#set_multicycle_path -hold 3 -to [get_cells D_OE*]
#set_multicycle_path -setup 4 -to [get_cells FC_OE*]
#set_multicycle_path -hold 3 -to [get_cells FC_OE*]
#set_multicycle_path -setup 2 -to [get_cells r_abus*]
#set_multicycle_path -hold 1 -to [get_cells r_abus*]

#set_multicycle_path -setup 3 -to [get_cells r_uds_drive*]
#set_multicycle_path -hold 2 -to [get_cells r_uds_drive*]
#set_multicycle_path -setup 3 -to [get_cells r_lds_drive*]
#set_multicycle_path -hold 2 -to [get_cells r_lds_drive*]
#set_multicycle_path -setup 3 -to [get_cells r_as_drive*]
#set_multicycle_path -hold 2 -to [get_cells r_as_drive*]
#set_multicycle_path -setup 3 -to [get_cells r_as_ds_clear*]
#set_multicycle_path -hold 2 -to [get_cells r_as_ds_clear*]
#set_multicycle_path -setup 3 -to [get_cells r_rw_drive*]
#set_multicycle_path -hold 2 -to [get_cells r_rw_drive*]
#set_multicycle_path -setup 3 -to [get_cells r_rw_clear*]
#set_multicycle_path -hold 2 -to [get_cells r_rw_clear*]

#set_multicycle_path -setup 3 -to [get_cells second_cycle*]
#set_multicycle_path -hold 2 -to [get_cells second_cycle*]

# False paths
####################

#set_false_path -from [get_ports {PI_GPIO_IN*}]
#set_false_path -to [get_ports {PI_GPIO_OUT*}]
#set_false_path -to [get_pins [get_cells PI_GPIO_OUT*]|CE]

# r_* registers  drive the *_OE outputs directly, do not clock-analyze it
set_false_path -from [get_cells r_*drive*] -to [get_cells *_OE*]
set_false_path -from [get_cells r_*clear*] -to [get_cells *_OE*]
set_false_path -from [get_cells r_*clear*] -to [get_cells */clear*]

# GPIO Constraints
####################

#set_multicycle_path 2 -setup -to [get_cells req_data_read*]
#set_multicycle_path 3 -hold -to [get_cells req_data_read*]
#set_multicycle_path 3 -setup -to [get_cells A_OUT*]
#set_multicycle_path 3 -hold -to [get_cells A_OUT*]
#set_multicycle_path 3 -setup -to [get_cells D_OUT*]
#set_multicycle_path 3 -hold -to [get_cells D_OUT*]

#set_multicycle_path 2 -setup -to [get_cells r_abus*]
#set_multicycle_path 2 -setup -to [get_cells r_dbus*]

#set_multicycle_path 2 -hold -to [get_cells r_abus*]
#set_multicycle_path 2 -hold -to [get_cells r_dbus*]

#set_multicycle_path 2 -setup -to [get_cells r_address_p2*]
#set_multicycle_path 2 -hold -to [get_cells r_address_p2*]

#et_multicycle_path 2 -setup -to [get_cells D_OE*]
#et_multicycle_path 2 -hold -to [get_cells D_OE*]
#set_multicycle_path 2 -setup -to [get_cells A_OE*]
#et_multicycle_path 2 -setup -from [get_ports D_IN*]
#et_multicycle_path 2 -hold -from [get_ports D_IN*]

#set_output_delay -clock CLK_7M -min -10 [get_ports {ECLK}]
#set_output_delay -clock CLK_7M -max 10 [get_ports {ECLK}]
#set_output_delay -clock SYS_PLL_CLKOUT0 4 [get_ports A_OUT*]
#set_output_delay -clock SYS_PLL_CLKOUT0 4 [get_ports A_OUT*]
#set_output_delay -clock SYS_PLL_CLKOUT0 4 [get_ports A_OE*]
#set_output_delay -clock SYS_PLL_CLKOUT0 4 [get_ports A_OE*]

#set_output_delay -clock MCCLK -min 0 [get_ports {A_OUT*}]
#set_output_delay -clock MCCLK -max 3 [get_ports {A_OUT*}]

# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IN_CLK_50M}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IN_CLK_50M}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nDTACK}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nDTACK}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[18]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[18]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[19]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[19]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[20]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[20]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[21]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[21]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[22]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[22]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_IN[23]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_IN[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OUT[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OUT[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {A_OE[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {A_OE[23]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {D_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {D_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nAS_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nAS_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nAS_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nAS_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nAS_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nAS_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBG_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBG_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBG_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBG_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBG_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBG_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBGACK_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBGACK_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBGACK_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBGACK_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBGACK_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBGACK_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBR_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBR_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBR_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBR_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBR_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBR_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nLDS_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nLDS_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nLDS_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nLDS_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nLDS_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nLDS_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nUDS_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nUDS_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nUDS_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nUDS_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nUDS_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nUDS_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[18]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[18]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[19]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[19]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[20]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[20]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[21]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[21]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[22]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[22]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[23]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[23]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[24]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[24]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[24]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[24]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[24]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[24]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[25]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[25]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[25]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[25]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[25]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[25]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[26]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[26]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[26]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[26]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[26]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[26]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_IN[27]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_IN[27]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OUT[27]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OUT[27]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_GPIO_OE[27]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_GPIO_OE[27]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {RnW_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {RnW_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {RnW_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {RnW_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {RnW_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {RnW_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[8]}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IPL[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IPL[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DBG_CLK}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DBG_CLK}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DBG_DAT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DBG_DAT}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {TP_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {TP_OE[4]}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {CLK_7M}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {CLK_7M}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IPL[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IPL[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {IPL[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {IPL[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nBERR}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nBERR}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVPA}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVPA}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {FC_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {FC_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nHALT_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nHALT_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nHALT_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nHALT_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nHALT_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nHALT_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nRESET_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nRESET_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nRESET_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nRESET_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nRESET_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nRESET_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVMA_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVMA_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVMA_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVMA_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {nVMA_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {nVMA_OE}]

# LVDS Tx Constraints
####################
